zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
  if (!paired_ || !authComplete_) {
    return kIdlePrePairingReportIntervalMs;
  }

  return kIdleConnectedReportIntervalMs;
}

void ClassicBtControllerTransport::sendTaskTrampoline(void *param) {
  auto *transport = static_cast<ClassicBtControllerTransport *>(param);
  if (kSendTaskStartupDelayMs > 0) {
    vTaskDelay(pdMS_TO_TICKS(kSendTaskStartupDelayMs));
  }
  while (true) {
    if (!transport->explicitInputActive_) {
      transport->sendCurrentInputReport(false);
    }
    if (kUseFixedSendInterval) {
      vTaskDelay(pdMS_TO_TICKS(kFixedSendTaskIntervalMs));
    } else {
      vTaskDelay(pdMS_TO_TICKS(transport->idleSendIntervalMs()));
    }
  }
}

bool ClassicBtControllerTransport::pressButtons(
    uint32_t buttonsMask, uint16_t holdMs, uint16_t settleMs) {
  if (!beginExplicitInput()) {
    return false;
  }
  setButtonBits(buttonsMask);
  updateInputReport();
  bool ok = repeatCurrentInputReport(holdMs, true);
  clearInputs();
  if (!repeatCurrentInputReport(settleMs, true)) {
    ok = false;
  }
  endExplicitInput();
  return ok;
}

bool ClassicBtControllerTransport::moveDirection(
    int x, int y, uint16_t holdMs, uint16_t settleMs) {
  if (!beginExplicitInput()) {
    return false;
  }
  buttonsRight_ = 0;
  buttonsShared_ = 0;
  buttonsLeft_ = 0;
  setLeftStickFromVector(x, y);
  updateInputReport();
  bool ok = repeatCurrentInputReport(holdMs, true);
  clearInputs();
  if (!repeatCurrentInputReport(settleMs, true)) {
    ok = false;
  }
  endExplicitInput();
  return ok;
}

bool ClassicBtControllerTransport::resetConnection(bool reconnectLastPeer) {
  const bool shouldReconnectLastPeer =
      reconnectLastPeer && hasPeerAddress_ && hasReconnectablePeer_;
  Serial.printf(
      "INFO bt reset requested mode=stack-restart reconnect_last_peer=%s\n",
      boolName(shouldReconnectLastPeer));

  shutdownClassicBluetooth();

  clearInputs();
  reconnectLastPeerOnRegister_ = shouldReconnectLastPeer;

  if (!initializeClassicBluetooth()) {
    reconnectLastPeerOnRegister_ = false;
    Serial.printf("WARN bt reset restart failed step=%s err=%s\n", initStep_, initError_);
    return false;
  }

  Serial.printf(
      "INFO bt reset completed mode=stack-restart reconnect_last_peer=%s\n",
      boolName(reconnectLastPeerOnRegister_));
  return true;
}

bool ClassicBtControllerTransport::clearStoredPeer() {
  const bool hadPeerAddress = hasPeerAddress_;
  uint8_t previousPeerAddress[6] = {};

  if (hadPeerAddress) {
    std::memcpy(previousPeerAddress, lastPeerAddress_, sizeof(previousPeerAddress));
  }

  if (!clearPersistedPeerAddress()) {
    return false;
  }

  hasPeerAddress_ = false;
  hasReconnectablePeer_ = false;
  reconnectLastPeerOnRegister_ = false;
  std::memset(lastPeerAddress_, 0, sizeof(lastPeerAddress_));

  if (hadPeerAddress) {
    Serial.printf(
        "INFO bt cleared_peer=%s\n",
        formatBluetoothAddress(previousPeerAddress).c_str());
  } else {
    Serial.println("INFO bt cleared_peer=none");
  }

  return true;
}

bool ClassicBtControllerTransport::clearPersistedPeerAddress() {
  nvs_handle handle = 0;
  esp_err_t err = nvs_open("storage", NVS_READWRITE, &handle);
  if (err != ESP_OK) {
    Serial.printf("WARN bt clear_peer open failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  err = nvs_erase_key(handle, "peer_addr");
  if (err == ESP_ERR_NVS_NOT_FOUND) {
    nvs_close(handle);
    return true;
  }

  if (err == ESP_OK) {
    err = nvs_commit(handle);
  }
  nvs_close(handle);

  if (err != ESP_OK) {
    Serial.printf("WARN bt clear_peer failed err=%s\n", esp_err_to_name(err));
    return false;
  }

  return true;
}

void ClassicBtControllerTransport::enterReconnectableState(const char *reason) {
  connected_ = false;
  readyForReports_ = false;
  authComplete_ = false;
  pairingComplete_ = false;
  paired_ = false;
  discoverable_ = true;
  reportCongested_ = false;
  consecutiveSendReportFailures_ = 0;
  lastDropReason_ = reason;
  clearInputs();

  esp_err_t err = ESP_OK;
  if (gapReady_ && appRegistered_) {
    err = esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
    discoverable_ = err == ESP_OK;
  }

  Serial.printf(
      "INFO bt reconnectable reason=%s discoverable=%s err=%s\n",
      reason,
      boolName(discoverable_),
      esp_err_to_name(err));
}

void ClassicBtControllerTransport::printStatus(Print &output) const {
  output.println("INFO bt_mode=classic-bt-hid");
  output.println("INFO bt_profile=uartswitchcon-pro-controller");
  output.print("INFO bt_stack_started=");
  output.println(boolName(stackStarted_));
  output.print("INFO bt_bluedroid_ready=");
  output.println(boolName(bluedroidReady_));
  output.print("INFO bt_gap_ready=");
  output.println(boolName(gapReady_));
  output.print("INFO bt_hid_ready=");
  output.println(boolName(hidReady_));
  output.print("INFO bt_app_registered=");
  output.println(boolName(appRegistered_));
  output.print("INFO bt_discoverable=");
  output.println(boolName(discoverable_));
  output.print("INFO bt_connected=");
  output.println(boolName(connected_));
  output.print("INFO bt_auth_complete=");
  output.println(boolName(authComplete_));
  output.print("INFO bt_pairing_complete=");
  output.println(boolName(pairingComplete_));
  output.print("INFO bt_paired=");
  output.println(boolName(paired_));
  output.print("INFO bt_ready_for_reports=");
  output.println(boolName(isControllerInputReady()));
  output.print("INFO bt_init_step=");
  output.println(initStep_);
  output.print("INFO bt_init_error=");
  output.println(initError_);
  output.print("INFO bt_last_drop_reason=");
  output.println(lastDropReason_);
  output.print("INFO bt_ignored_report_count=");
  output.println(ignoredReportCount_);
  output.print("INFO bt_last_ignored_report=");
  output.print(lastIgnoredReportId_);
  output.print("/");
  output.println(lastIgnoredReportLen_);
  output.print("INFO bt_last_acl_disconnect_reason=");
  output.println(lastAclDisconnectReason_);
  output.print("INFO bt_last_hid_close_status=");
  output.println(lastHidCloseStatus_);
  output.print("INFO bt_last_hid_close_conn_status=");
  output.println(lastHidCloseConnStatus_);
  output.print("INFO bt_send_report_failures=");
  output.println(sendReportFailureCount_);
  output.print("INFO bt_last_send_report_status=");
  output.println(lastSendReportStatus_);
  output.print("INFO bt_last_send_report_reason=");
  output.println(lastSendReportReason_);
  output.print("INFO bt_last_send_report_id=");
  output.println(lastSendReportId_);
  output.print("INFO bt_last_peer_reconnectable=");
  output.println(boolName(hasReconnectablePeer_));

