zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
void ClassicBtControllerTransport::handleHidEvent(int event, void *rawParam) {
  const auto hidEvent = static_cast<esp_hidd_cb_event_t>(event);
  auto *param = reinterpret_cast<esp_hidd_cb_param_t *>(rawParam);

  switch (hidEvent) {
    case ESP_HIDD_INIT_EVT: {
      hidReady_ = param->init.status == ESP_HIDD_SUCCESS;
      initStep_ = "hid_init_event";
      initError_ = esp_err_to_name(static_cast<esp_err_t>(param->init.status));
      Serial.printf("INFO bt hid event=init status=%d\n", param->init.status);
      if (hidReady_) {
        const esp_err_t err =
            esp_bt_hid_device_register_app(&kHidAppParam, &kHidQos, &kHidQos);
        if (err != ESP_OK) {
          Serial.printf("WARN bt register_app failed err=%s\n", esp_err_to_name(err));
        }
      }
      break;
    }
    case ESP_HIDD_REGISTER_APP_EVT:
      appRegistered_ = param->register_app.status == ESP_HIDD_SUCCESS;
      initStep_ = "register_app_event";
      initError_ = esp_err_to_name(static_cast<esp_err_t>(param->register_app.status));
      Serial.printf(
          "INFO bt hid event=register-app status=%d in_use=%s\n",
          param->register_app.status,
          param->register_app.in_use ? "true" : "false");
      if (appRegistered_) {
        esp_bt_gap_set_cod(kDeviceClass, ESP_BT_SET_COD_ALL);
        const esp_err_t err =
            esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE);
        discoverable_ = err == ESP_OK;
        if (err != ESP_OK) {
          initError_ = esp_err_to_name(err);
          Serial.printf("WARN bt set_scan_mode failed err=%s\n", esp_err_to_name(err));
        } else {
          initStep_ = "discoverable";
          initError_ = "ESP_OK";
        }

        if (param->register_app.in_use && param->register_app.bd_addr != nullptr) {
          reconnectLastPeerOnRegister_ = false;
          attemptVirtualCablePlug(param->register_app.bd_addr, "register-app");
        } else if (reconnectLastPeerOnRegister_ && hasPeerAddress_) {
          // Only explicit recovery resets should preferentially reconnect the
          // previously authenticated host; ordinary pairing stays neutral.
          reconnectLastPeerOnRegister_ = false;
          attemptVirtualCablePlug(lastPeerAddress_, "register-app-last-peer");
        } else {
          reconnectLastPeerOnRegister_ = false;
        }
      }
      break;
    case ESP_HIDD_OPEN_EVT:
      connected_ = param->open.status == ESP_HIDD_SUCCESS &&
                   param->open.conn_status == ESP_HIDD_CONN_STATE_CONNECTED;
      readyForReports_ = connected_ && appRegistered_ && hidReady_;
      discoverable_ = !connected_;
      reportCongested_ = false;
      consecutiveSendReportFailures_ = 0;
      if (connected_) {
        const bool samePeer =
            hasPeerAddress_ &&
            std::memcmp(lastPeerAddress_, param->open.bd_addr, sizeof(lastPeerAddress_)) == 0;
        std::memcpy(lastPeerAddress_, param->open.bd_addr, sizeof(lastPeerAddress_));
        hasPeerAddress_ = true;
        if (!samePeer) {
          hasReconnectablePeer_ = false;
        }
        esp_bt_gap_set_scan_mode(ESP_BT_NON_CONNECTABLE, ESP_BT_NON_DISCOVERABLE);
        ensureSendTask();
        sendCurrentInputReport(false);
      }
      Serial.printf(
          "INFO bt hid event=open status=%d conn=%d peer=%s\n",
          param->open.status,
          param->open.conn_status,
          connected_ ? formatBluetoothAddress(lastPeerAddress_).c_str() : "unknown");
      break;
    case ESP_HIDD_CLOSE_EVT:
      lastHidCloseStatus_ = param->close.status;
      lastHidCloseConnStatus_ = param->close.conn_status;
      enterReconnectableState("hid-close");
      Serial.printf(
          "INFO bt hid event=close status=%d conn=%d\n",
          param->close.status,
          param->close.conn_status);
      break;
    case ESP_HIDD_SEND_REPORT_EVT:
      if (param->send_report.status != ESP_HIDD_SUCCESS) {
        sendReportFailureCount_ += 1;
        if (consecutiveSendReportFailures_ < UINT8_MAX) {
          consecutiveSendReportFailures_ += 1;
        }
      } else {
        consecutiveSendReportFailures_ = 0;
      }
      lastSendReportStatus_ = param->send_report.status;
      lastSendReportReason_ = param->send_report.reason;
      lastSendReportId_ = param->send_report.report_id;
      if (param->send_report.report_id == 0x30) {
        lastInputReportStatus_ = param->send_report.status;
        lastInputReportReason_ = param->send_report.reason;
        inputReportSendEventCount_ += 1;
      }
      reportCongested_ = param->send_report.status != ESP_HIDD_SUCCESS &&
                         param->send_report.reason == kHidErrCongested;
      readyForReports_ = isHidReportChannelOpen();
      if (param->send_report.status != ESP_HIDD_SUCCESS) {
        const bool isRoutineCongestion =
            param->send_report.reason == kHidErrCongested ||
            param->send_report.reason == 0;
        const bool shouldLogSendReportWarning =
            !kSuppressRoutineCongestionWarnings || !isRoutineCongestion;
        if (shouldLogSendReportWarning) {
          Serial.printf(
              "WARN bt hid event=send-report status=%d reason=%u report=%u\n",
              param->send_report.status,
              param->send_report.reason,
              param->send_report.report_id);
        }
      }
      break;
    case ESP_HIDD_GET_REPORT_EVT:
      Serial.printf(
          "INFO bt hid event=get-report type=%d report=%u size=%u\n",
          param->get_report.report_type,
          param->get_report.report_id,
          param->get_report.buffer_size);
      break;
    case ESP_HIDD_SET_REPORT_EVT:
      Serial.printf(
          "INFO bt hid event=set-report type=%d report=%u len=%u\n",
          param->set_report.report_type,
          param->set_report.report_id,
          param->set_report.len);
      break;
    case ESP_HIDD_SET_PROTOCOL_EVT:
      Serial.printf(
          "INFO bt hid event=set-protocol protocol=%u\n",
          param->set_protocol.protocol_mode);
      break;
    case ESP_HIDD_INTR_DATA_EVT:
      processIncomingReport(
          param->intr_data.report_id,
          param->intr_data.len,
          param->intr_data.data);
      break;
    case ESP_HIDD_REPORT_ERR_EVT:
      Serial.printf(
          "WARN bt hid event=report-error status=%d reason=%u\n",
          param->report_err.status,
          param->report_err.reason);
      break;
    case ESP_HIDD_API_ERR_EVT:
      Serial.println("WARN bt hid event=api-error");
      break;
    case ESP_HIDD_DEINIT_EVT:
      hidReady_ = false;
      appRegistered_ = false;
      discoverable_ = false;
      connected_ = false;
      readyForReports_ = false;
      authComplete_ = false;
      pairingComplete_ = false;
      paired_ = false;
      Serial.printf("INFO bt hid event=deinit status=%d\n", param->deinit.status);
      break;
    case ESP_HIDD_UNREGISTER_APP_EVT:
      appRegistered_ = false;
      discoverable_ = false;
      Serial.printf("INFO bt hid event=unregister-app status=%d\n", param->unregister_app.status);
      break;
    case ESP_HIDD_VC_UNPLUG_EVT:
      enterReconnectableState("vc-unplug");
      Serial.printf(
          "INFO bt hid event=vc-unplug status=%d conn=%d\n",
          param->vc_unplug.status,
          param->vc_unplug.conn_status);
      break;
    default:
      Serial.printf("INFO bt hid event=%d\n", hidEvent);
      break;
  }
}

