zhouxiyu1997/friendmaker/firmware/esp32/src/classic_bt_controller_transport.cpp
void ClassicBtControllerTransport::onGapEvent(int event, void *param) {
  if (instance_ != nullptr) {
    instance_->handleGapEvent(event, param);
  }
}

void ClassicBtControllerTransport::onHidEvent(int event, void *param) {
  if (instance_ != nullptr) {
    instance_->handleHidEvent(event, param);
  }
}

#else

ClassicBtControllerTransport *ClassicBtControllerTransport::instance_ = nullptr;

void ClassicBtControllerTransport::begin() {}

bool ClassicBtControllerTransport::pressButtons(
    uint32_t buttonsMask, uint16_t holdMs, uint16_t settleMs) {
  (void)buttonsMask;
  delay(holdMs);
  delay(settleMs);
  return false;
}

bool ClassicBtControllerTransport::moveDirection(
    int x, int y, uint16_t holdMs, uint16_t settleMs) {
  (void)x;
  (void)y;
  delay(holdMs);
  delay(settleMs);
  return false;
}

bool ClassicBtControllerTransport::resetConnection(bool reconnectLastPeer) {
  (void)reconnectLastPeer;
  return false;
}

bool ClassicBtControllerTransport::clearStoredPeer() { return false; }

void ClassicBtControllerTransport::printStatus(Print &output) const {
  output.println("INFO bt_mode=classic-bt-disabled");
}

const char *ClassicBtControllerTransport::name() const { return CONTROL_TRANSPORT; }

bool ClassicBtControllerTransport::initializeClassicBluetooth() { return false; }
bool ClassicBtControllerTransport::initializeNvsAndBaseAddress() { return false; }
void ClassicBtControllerTransport::clearInputs() {}
void ClassicBtControllerTransport::setButtonBits(uint32_t buttonsMask) { (void)buttonsMask; }
void ClassicBtControllerTransport::setLeftStickFromVector(int x, int y) {
  (void)x;
  (void)y;
}
void ClassicBtControllerTransport::updateInputReport() {}
void ClassicBtControllerTransport::ensureSendTask() {}
bool ClassicBtControllerTransport::isHidReportChannelOpen() const { return false; }
bool ClassicBtControllerTransport::isControllerInputReady() const { return false; }
bool ClassicBtControllerTransport::sendCurrentInputReport(bool logFailure, bool waitForSendEvent) {
  (void)logFailure;
  (void)waitForSendEvent;
  return false;
}
bool ClassicBtControllerTransport::shouldRetryAfterTransientSendFailure() const { return false; }
bool ClassicBtControllerTransport::waitForInputReportAccepted(
    uint32_t expectedEventCount, bool logFailure) {
  (void)expectedEventCount;
  (void)logFailure;
  return false;
}
bool ClassicBtControllerTransport::waitForInputReportDrain(uint32_t timeoutMs, bool logFailure) {
  (void)timeoutMs;
  (void)logFailure;
  return false;
}
bool ClassicBtControllerTransport::beginExplicitInput() { return false; }
void ClassicBtControllerTransport::endExplicitInput() {}
bool ClassicBtControllerTransport::repeatCurrentInputReport(uint16_t durationMs, bool logFailure) {
  (void)durationMs;
  (void)logFailure;
  return false;
}
void ClassicBtControllerTransport::resetInputReportTracking() {}
bool ClassicBtControllerTransport::clearPersistedPeerAddress() { return false; }
void ClassicBtControllerTransport::markControllerPaired() {}
bool ClassicBtControllerTransport::sendSubcommandReply(
    uint8_t reportId, const uint8_t *data, size_t length, const char *label) {
  (void)reportId;
  (void)data;
  (void)length;
  (void)label;
  return false;
}
void ClassicBtControllerTransport::processIncomingReport(uint8_t reportId, uint16_t len, uint8_t *data) {
  (void)reportId;
  (void)len;
  (void)data;
}
void ClassicBtControllerTransport::handleGapEvent(int event, void *param) {
  (void)event;
  (void)param;
}
void ClassicBtControllerTransport::handleHidEvent(int event, void *param) {
  (void)event;
  (void)param;
}
void ClassicBtControllerTransport::onGapEvent(int event, void *param) {
  (void)event;
  (void)param;
}
void ClassicBtControllerTransport::onHidEvent(int event, void *param) {
  (void)event;
  (void)param;
}
void ClassicBtControllerTransport::sendTaskTrampoline(void *param) { (void)param; }

#endif
